espressif/binutils-esp32ulp/bfd/elf32-esp32ulp.c
#include "sysdep.h"
#include "bfd.h"
#include "libbfd.h"
#include "elf-bfd.h"
#include "elf/esp32ulp.h"
#include "dwarf2.h"
#include "hashtab.h"

/* FUNCTION : esp32ulp_pltpc_reloc
ABSTRACT : TODO : figure out how to handle pltpc relocs.  */
static bfd_reloc_status_type
esp32ulp_pltpc_reloc(
bfd *abfd ATTRIBUTE_UNUSED,
arelent *reloc_entry ATTRIBUTE_UNUSED,
asymbol *symbol ATTRIBUTE_UNUSED,
void * data ATTRIBUTE_UNUSED,
asection *input_section ATTRIBUTE_UNUSED,
bfd *output_bfd ATTRIBUTE_UNUSED,
char **error_message ATTRIBUTE_UNUSED)
{
	bfd_reloc_status_type flag = bfd_reloc_ok;
	return flag;
}
static bfd_reloc_status_type
esp32ulp_imm16_reloc(bfd *abfd,
arelent *reloc_entry,
asymbol *symbol,
void * data,
asection *input_section,
bfd *output_bfd,
char **error_message ATTRIBUTE_UNUSED)
{
	DEBUG_TRACE("dya_pass esp32ulp_imm16_reloc\n");
	bfd_vma relocation, x;
	bfd_size_type reloc_addr = reloc_entry->address;
	bfd_vma output_base = 0;
	reloc_howto_type *howto = reloc_entry->howto;
	asection *output_section;
	bfd_boolean relocatable = (output_bfd != NULL);

	/* Is the address of the relocation really within the section?  */
	if (reloc_entry->address > bfd_get_section_limit(abfd, input_section))
		return bfd_reloc_outofrange;

	if (bfd_is_und_section(symbol->section)
		&& (symbol->flags & BSF_WEAK) == 0
		&& !relocatable)
		return bfd_reloc_undefined;

	output_section = symbol->section->output_section;
	relocation = symbol->value;

	/* Convert input-section-relative symbol value to absolute.  */
	if (relocatable)
		output_base = 0;
	else
		output_base = output_section->vma;

	if (!relocatable || !strcmp(symbol->name, symbol->section->name))
		relocation += output_base + symbol->section->output_offset;

	/* Add in supplied addend.  */
	relocation += reloc_entry->addend;

	if (relocatable)
	{
		reloc_entry->address += input_section->output_offset;
		reloc_entry->addend += symbol->section->output_offset;
	}
	else
	{
		reloc_entry->addend = 0;
	}

	if (howto->complain_on_overflow != complain_overflow_dont)
	{
		bfd_reloc_status_type flag;
		flag = bfd_check_overflow(howto->complain_on_overflow,
			howto->bitsize,
			howto->rightshift,
			bfd_arch_bits_per_address(abfd),
			relocation);
		if (flag != bfd_reloc_ok)
			return flag;
	}

	/* Here the variable relocation holds the final address of the
	symbol we are relocating against, plus any addend.  */

	DEBUG_TRACE("dya_pass - esp32ulp_imm16_reloc = %i, reloc_addr=%i, howto->rightshift=%i\n", (unsigned int)relocation, (unsigned int)reloc_addr, (int)howto->rightshift);
	relocation >>= (bfd_vma)howto->rightshift;
	x = relocation;
	bfd_put_16(abfd, x, (unsigned char *)data + reloc_addr);
	return bfd_reloc_ok;
}


static bfd_reloc_status_type
esp32ulp_jumprelr_reloc(bfd *abfd,
arelent *reloc_entry,
asymbol *symbol,
void * data,
asection *input_section,
bfd *output_bfd,
char **error_message ATTRIBUTE_UNUSED)
{
	bfd_vma relocation;
	bfd_size_type addr = reloc_entry->address;
	bfd_vma output_base = 0;
	asection *output_section;
	bfd_boolean relocatable = (output_bfd != NULL);

	DEBUG_TRACE("dya_pass esp32ulp_jumprelr_reloc: relocatable=%i\n", (int)relocatable);

	/* Is the address of the relocation really within the section?  */
	if (reloc_entry->address > bfd_get_section_limit(abfd, input_section))
		return bfd_reloc_outofrange;

	if (bfd_is_und_section(symbol->section)
		&& (symbol->flags & BSF_WEAK) == 0
		&& !relocatable)
		return bfd_reloc_undefined;

	output_section = symbol->section->output_section;
	relocation = symbol->value;
	/* Convert input-section-relative symbol value to absolute.  */
	if (relocatable)
		output_base = 0;
	else
		output_base = output_section->vma;

	if ((symbol->name
		&& symbol->section->name
		&& !strcmp(symbol->name, symbol->section->name))
		|| !relocatable)
	{
		relocation += output_base + symbol->section->output_offset;
	}

	relocation += reloc_entry->addend;

	if (relocatable)
	{
		/* This output will be relocatable ... like ld -r. */
		reloc_entry->address += input_section->output_offset;
		reloc_entry->addend += symbol->section->output_offset;
		DEBUG_TRACE("dya_pass esp32ulp_jumprelr_reloc: address=%08x, addend=%08x, symbol->value=%08x\n", (int)reloc_entry->address, (int)reloc_entry->addend, (int)symbol->value);
	}
	else
	{
		reloc_entry->addend = 0;
	}

	/* Here the variable relocation holds the final address of the
	symbol we are relocating against, plus any addend.  */
	unsigned int ddd = 0;
	memcpy(&ddd, (unsigned char *)data + addr, 4);
	relocation -= reloc_entry->address;
	DEBUG_TRACE("dya_pass esp32ulp_jumprelr_reloc: relocation=%08x, ddd=%08x\n", (unsigned int)relocation, ddd);
	ddd &= ~(0x000000ff < 17);
	int reloc = (int)relocation;
	if (reloc >= 0)
	{
		ddd |= ((reloc & 0x7f) << 17);
	}
	else
	{
		reloc = -reloc;
		ddd |= ((reloc & 0x7f) << 17) | (0x01 << 24);
	}
	memcpy((unsigned char *)data + addr, &ddd, 4);
	DEBUG_TRACE("dya_pass esp32ulp_jumprelr_reloc: final = reloc=%08x, ddd=%08x\n", (unsigned int)reloc, ddd);
	return bfd_reloc_ok;
}

static bfd_reloc_status_type
esp32ulp_bfd_reloc(bfd *abfd,
arelent *reloc_entry,
asymbol *symbol,
void * data,
asection *input_section,
bfd *output_bfd,
char **error_message ATTRIBUTE_UNUSED)
{
	bfd_vma relocation;
	bfd_size_type addr = reloc_entry->address;
	bfd_vma output_base = 0;
	reloc_howto_type *howto = reloc_entry->howto;
	asection *output_section;
	bfd_boolean relocatable = (output_bfd != NULL);

	/* Is the address of the relocation really within the section?  */
	if (reloc_entry->address > bfd_get_section_limit(abfd, input_section))
		return bfd_reloc_outofrange;

	if (bfd_is_und_section(symbol->section)
		&& (symbol->flags & BSF_WEAK) == 0
		&& !relocatable)
		return bfd_reloc_undefined;

	/* Get symbol value.  (Common symbols are special.)  */
	if (bfd_is_com_section(symbol->section))
		relocation = 0;
	else
		relocation = symbol->value;

	output_section = symbol->section->output_section;

	/* Convert input-section-relative symbol value to absolute.  */
	if (relocatable)
		output_base = 0;
	else
		output_base = output_section->vma;

