espressif/binutils-esp32ulp/bfd/elf32-esp32ulp.c
	if (!relocatable || !strcmp(symbol->name, symbol->section->name))
		relocation += output_base + symbol->section->output_offset;

	if (!relocatable && !strcmp(symbol->name, symbol->section->name))
	{
		/* Add in supplied addend.  */
		relocation += reloc_entry->addend;
	}

	/* Here the variable relocation holds the final address of the
	symbol we are relocating against, plus any addend.  */

	if (howto->pc_relative == TRUE)
	{
		relocation -= input_section->output_section->vma + input_section->output_offset;

		if (howto->pcrel_offset == TRUE)
			relocation -= reloc_entry->address;
	}

	if (relocatable)
	{
		reloc_entry->address += input_section->output_offset;
		reloc_entry->addend += symbol->section->output_offset;
	}

	if (howto->complain_on_overflow != complain_overflow_dont)
	{
		bfd_reloc_status_type status;

		status = bfd_check_overflow(howto->complain_on_overflow,
			howto->bitsize,
			howto->rightshift,
			bfd_arch_bits_per_address(abfd),
			relocation);
		if (status != bfd_reloc_ok)
			return status;
	}

	/* If rightshift is 1 and the number odd, return error.  */
	if (howto->rightshift && (relocation & 0x01))
	{
		_bfd_error_handler(_("relocation should be even number"));
		return bfd_reloc_overflow;
	}

	relocation >>= (bfd_vma)howto->rightshift;

	/* Shift everything up to where it's going to be used.  */

	relocation <<= (bfd_vma)howto->bitpos;

#define DOIT(x)								\
  x = ( (x & ~howto->dst_mask) | (relocation & howto->dst_mask))

	/* handle 8 and 16 bit relocations here. */
	switch (howto->size)
	{
	case 0:
	{
		char x = bfd_get_8(abfd, (char *)data + addr);
		DOIT(x);
		bfd_put_8(abfd, x, (unsigned char *)data + addr);
	}
	break;

	case 1:
	{
		unsigned short x = bfd_get_16(abfd, (bfd_byte *)data + addr);
		DOIT(x);
		bfd_put_16(abfd, (bfd_vma)x, (unsigned char *)data + addr);
	}
	break;

	default:
		return bfd_reloc_other;
	}

	return bfd_reloc_ok;
}

/* HOWTO Table for esp ulp.
 */

#define ESP32ULP_RELOC_MIN 0
#define ESP32ULP_RELOC_MAX 0x21
#define ESP32ULP_GNUEXT_RELOC_MIN 0x40
#define ESP32ULP_GNUEXT_RELOC_MAX 0x43
#define ESP32ULP_ARELOC_MIN 0xE0
#define ESP32ULP_ARELOC_MAX 0xF3

static reloc_howto_type esp32ulp_howto_table[] =
{
	/* This reloc does nothing. .  */
	HOWTO(R_ESP32ULP_UNUSED0,	/* type.  */
	0,			/* rightshift.  */
	3,			/* size (0 = byte, 1 = short, 2 = long).  */
	0,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	0,			/* bitpos.  */
	complain_overflow_dont, /* complain_on_overflow.  */
	bfd_elf_generic_reloc,	/* special_function.  */
	"R_ESP32ULP_UNUSED0",	/* name.  */
	FALSE,			/* partial_inplace.  */
	0,			/* src_mask.  */
	0,			/* dst_mask.  */
	FALSE),		/* pcrel_offset.  */


	HOWTO(R_ESP32ULP_RIMM16,		/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	16,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	2,			/* bitpos.  */
	complain_overflow_signed, /* complain_on_overflow.  */
	esp32ulp_imm16_reloc,	/* special_function.  */
	"R_ESP32ULP_RIMM16",	/* name.  */
	FALSE,			/* partial_inplace.  */
	0,				/* src_mask.  */ // dya-pass - 0
	0x00001FFC,		/* dst_mask.  */
	TRUE),			/* pcrel_offset.  */

	HOWTO(R_ESP32ULP_JUMPR,	/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	8,			/* bitsize.  */
	TRUE,			/* pc_relative.  */
	17,			/* bitpos.  */
	complain_overflow_signed, /* complain_on_overflow.  */
	esp32ulp_jumprelr_reloc,	/* special_function.  */
	"R_ESP32ULP_JUMPR",	/* name.  */
	FALSE,			/* partial_inplace.  */
	0,			  /* src_mask.  */
	(0xff << 17),		/* dst_mask.  */
	TRUE),			/* pcrel_offset.  */

	HOWTO(R_ESP32ULP_LOAD16,		/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	16,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	2,			/* bitpos.  */
	complain_overflow_signed, /* complain_on_overflow.  */
	esp32ulp_imm16_reloc,	/* special_function.  */
	"R_ESP32ULP_RIMM16",	/* name.  */
	FALSE,			/* partial_inplace.  */
	0,				/* src_mask.  */ // dya-pass - 0
	0x00001FFC,		/* dst_mask.  */
	TRUE),			/* pcrel_offset.  */

	HOWTO(R_ESP32ULP_WR_MEM,		/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	16,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	10,			/* bitpos.  */
	complain_overflow_signed, /* complain_on_overflow.  */
	NULL,		/* special_function.  */
	"R_ESP32ULP_WR_MEM",	/* name.  */
	FALSE,			/* partial_inplace.  */
	0,				/* src_mask.  */ // dya-pass - 0
	(0x7ff << 10),		/* dst_mask.  */
	FALSE),			/* pcrel_offset.  */

	HOWTO(R_ESP32ULP_ALUI,		/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	16,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	4,			/* bitpos.  */
	complain_overflow_signed, /* complain_on_overflow.  */
	NULL,		/* special_function.  */
	"R_ESP32ULP_ALUI",	/* name.  */
	FALSE,			/* partial_inplace.  */
	0,				/* src_mask.  */ // dya-pass - 0
	(0xffff << 4),		/* dst_mask.  */
	FALSE),			/* pcrel_offset.  */

	HOWTO(R_ESP32ULP_WAIT,		/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	16,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	0,			/* bitpos.  */
	complain_overflow_signed, /* complain_on_overflow.  */
	NULL,		/* special_function.  */
	"R_ESP32ULP_WAIT",	/* name.  */
	FALSE,			/* partial_inplace.  */
	0,				/* src_mask.  */ // dya-pass - 0
	(0xffff << 0),		/* dst_mask.  */
	FALSE),			/* pcrel_offset.  */

	HOWTO(R_ESP32ULP_TSENS_CYCLE,		/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	16,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	16,			/* bitpos.  */
	complain_overflow_signed, /* complain_on_overflow.  */
	NULL,		/* special_function.  */
	"R_ESP32ULP_TSENS_CYCLE",	/* name.  */
	FALSE,			/* partial_inplace.  */
	0,				/* src_mask.  */ // dya-pass - 0
	(0x3fff << 16),		/* dst_mask.  */
	FALSE),			/* pcrel_offset.  */

	HOWTO(R_ESP32ULP_TSENS_DELAY,		/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	16,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	2,			/* bitpos.  */
	complain_overflow_signed, /* complain_on_overflow.  */
	NULL,		/* special_function.  */
	"R_ESP32ULP_TSENS_DELAY",	/* name.  */
	FALSE,			/* partial_inplace.  */
	0,				/* src_mask.  */ // dya-pass - 0
	(0x3fff << 2),		/* dst_mask.  */
	FALSE),			/* pcrel_offset.  */


	HOWTO(R_ESP32ULP_ADC_CYCLE,		/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	16,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	8,			/* bitpos.  */
	complain_overflow_signed, /* complain_on_overflow.  */
	NULL,		/* special_function.  */
	"R_ESP32ULP_ADC_CYCLE",	/* name.  */
	FALSE,			/* partial_inplace.  */
	0,				/* src_mask.  */ // dya-pass - 0
	(0xffff << 8),		/* dst_mask.  */
	FALSE),			/* pcrel_offset.  */


	HOWTO(R_ESP32ULP_ADC_SEL,		/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	16,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	6,			/* bitpos.  */
	complain_overflow_signed, /* complain_on_overflow.  */
	NULL,		/* special_function.  */
	"R_ESP32ULP_ADC_SEL",	/* name.  */
	FALSE,			/* partial_inplace.  */
	0,				/* src_mask.  */ // dya-pass - 0
	(0x1 << 6),		/* dst_mask.  */
	FALSE),			/* pcrel_offset.  */


	HOWTO(R_ESP32ULP_ADC_MUX,		/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	16,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	2,			/* bitpos.  */
	complain_overflow_signed, /* complain_on_overflow.  */
	NULL,		/* special_function.  */
	"R_ESP32ULP_ADC_MUX",	/* name.  */
	FALSE,			/* partial_inplace.  */
	0,				/* src_mask.  */ // dya-pass - 0
	(0x0f << 2),		/* dst_mask.  */
	FALSE),			/* pcrel_offset.  */


	HOWTO(R_ESP32ULP_WAKE,		/* type.  */
	0,							/* rightshift.  */
	2,							/* size (0 = byte, 1 = short, 2 = long).  */
	16,							/* bitsize.  */
	FALSE,						/* pc_relative.  */
	0,							/* bitpos.  */
	complain_overflow_signed,	/* complain_on_overflow.  */
	NULL,						/* special_function.  */
	"R_ESP32ULP_WAKE",			/* name.  */
	FALSE,						/* partial_inplace.  */
	0,							/* src_mask.  */ // dya-pass - 0
	(0x1 << 0),					/* dst_mask.  */
	FALSE),						/* pcrel_offset.  */


	HOWTO(R_ESP32ULP_SLEEP,		/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	16,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	0,			/* bitpos.  */
	complain_overflow_signed, /* complain_on_overflow.  */
	NULL,		/* special_function.  */
	"R_ESP32ULP_SLEEP",	/* name.  */
	FALSE,			/* partial_inplace.  */
	0,				/* src_mask.  */ // dya-pass - 0
	(0x0f << 0),		/* dst_mask.  */
	FALSE),			/* pcrel_offset.  */

