espressif/binutils-esp32ulp/bfd/elf32-esp32ulp.c
	HOWTO(R_ESP32ULP_STAGE,		/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	16,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	4,			/* bitpos.  */
	complain_overflow_signed, /* complain_on_overflow.  */
	NULL,		/* special_function.  */
	"R_ESP32ULP_STAGE",	/* name.  */
	FALSE,			/* partial_inplace.  */
	0,				/* src_mask.  */ // dya-pass - 0
	(0xff << 4),		/* dst_mask.  */
	FALSE),			/* pcrel_offset.  */


	HOWTO(R_ESP32ULP_JUMPR_STEP,	/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	8,			/* bitsize.  */
	TRUE,			/* pc_relative.  */
	17,			/* bitpos.  */
	complain_overflow_signed, /* complain_on_overflow.  */
	esp32ulp_jumprelr_reloc,	/* special_function.  */
	"R_ESP32ULP_JUMPR_STEP",	/* name.  */
	FALSE,			/* partial_inplace.  */
	0,			  /* src_mask.  */
	(0xff << 17),		/* dst_mask.  */
	TRUE),			/* pcrel_offset.  */


	HOWTO(R_ESP32ULP_JUMPR_THRESH,		/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	16,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	0,			/* bitpos.  */
	complain_overflow_signed, /* complain_on_overflow.  */
	NULL,		/* special_function.  */
	"R_ESP32ULP_JUMPR_THRESH",	/* name.  */
	FALSE,			/* partial_inplace.  */
	0,				/* src_mask.  */ // dya-pass - 0
	(0xffff << 0),		/* dst_mask.  */
	FALSE),			/* pcrel_offset.  */

	HOWTO(R_ESP32ULP_JUMPS_THRESH,		/* type.  */
	0,									/* rightshift.  */
	2,									/* size (0 = byte, 1 = short, 2 = long).  */
	16,									/* bitsize.  */
	FALSE,								/* pc_relative.  */
	0,									/* bitpos.  */
	complain_overflow_signed,			/* complain_on_overflow.  */
	NULL,								/* special_function.  */
	"R_ESP32ULP_JUMPS_THRESH",			/* name.  */
	FALSE,								/* partial_inplace.  */
	0,									/* src_mask.  */ // dya-pass - 0
	(0xff << 0),						/* dst_mask.  */
	FALSE),								/* pcrel_offset.  */

	HOWTO(R_ESP32ULP_REG_RW_HIGH,	/* type.  */
	0,							/* rightshift.  */
	2,							/* size (0 = byte, 1 = short, 2 = long).  */
	16,							/* bitsize.  */
	FALSE,						/* pc_relative.  */
	23,							/* bitpos.  */
	complain_overflow_signed,	/* complain_on_overflow.  */
	NULL,						/* special_function.  */
	"R_ESP32ULP_REG_RW_HIGH",		/* name.  */
	FALSE,						/* partial_inplace.  */
	0,							/* src_mask.  */ // dya-pass - 0
	(0x3f << 23),				/* dst_mask.  */
	FALSE),						/* pcrel_offset.  */

	HOWTO(R_ESP32ULP_REG_RW_LOW,	/* type.  */
	0,							/* rightshift.  */
	2,							/* size (0 = byte, 1 = short, 2 = long).  */
	16,							/* bitsize.  */
	FALSE,						/* pc_relative.  */
	18,							/* bitpos.  */
	complain_overflow_signed,	/* complain_on_overflow.  */
	NULL,						/* special_function.  */
	"R_ESP32ULP_REG_RW_LOW",		/* name.  */
	FALSE,						/* partial_inplace.  */
	0,							/* src_mask.  */ // dya-pass - 0
	(0x3f << 18),				/* dst_mask.  */
	FALSE),						/* pcrel_offset.  */

	HOWTO(R_ESP32ULP_REG_RW_ADDR,	/* type.  */
	0,							/* rightshift.  */
	2,							/* size (0 = byte, 1 = short, 2 = long).  */
	16,							/* bitsize.  */
	FALSE,						/* pc_relative.  */
	0,							/* bitpos.  */
	complain_overflow_signed,	/* complain_on_overflow.  */
	NULL,						/* special_function.  */
	"R_ESP32ULP_REG_RW_ADDR",		/* name.  */
	FALSE,						/* partial_inplace.  */
	0,							/* src_mask.  */ // dya-pass - 0
	(0x3ff << 0),				/* dst_mask.  */
	FALSE),						/* pcrel_offset.  */

	HOWTO(R_ESP32ULP_REG_RW_DATA,	/* type.  */
	0,							/* rightshift.  */
	2,							/* size (0 = byte, 1 = short, 2 = long).  */
	16,							/* bitsize.  */
	FALSE,						/* pc_relative.  */
	10,							/* bitpos.  */
	complain_overflow_signed,	/* complain_on_overflow.  */
	NULL,						/* special_function.  */
	"R_ESP32ULP_REG_RW_DATA",		/* name.  */
	FALSE,						/* partial_inplace.  */
	0,							/* src_mask.  */ // dya-pass - 0
	(0xff << 10),				/* dst_mask.  */
	FALSE),						/* pcrel_offset.  */

	HOWTO(R_ESP32ULP_I2C_RW_HIGH,	/* type.  */
	0,							/* rightshift.  */
	2,							/* size (0 = byte, 1 = short, 2 = long).  */
	16,							/* bitsize.  */
	FALSE,						/* pc_relative.  */
	19,							/* bitpos.  */
	complain_overflow_signed,	/* complain_on_overflow.  */
	NULL,						/* special_function.  */
	"R_ESP32ULP_I2C_RW_HIGH",		/* name.  */
	FALSE,						/* partial_inplace.  */
	0,							/* src_mask.  */ // dya-pass - 0
	(0x7 << 19),				/* dst_mask.  */
	FALSE),						/* pcrel_offset.  */

	HOWTO(R_ESP32ULP_I2C_RW_LOW,	/* type.  */
	0,							/* rightshift.  */
	2,							/* size (0 = byte, 1 = short, 2 = long).  */
	16,							/* bitsize.  */
	FALSE,						/* pc_relative.  */
	16,							/* bitpos.  */
	complain_overflow_signed,	/* complain_on_overflow.  */
	NULL,						/* special_function.  */
	"R_ESP32ULP_I2C_RW_LOW",		/* name.  */
	FALSE,						/* partial_inplace.  */
	0,							/* src_mask.  */ // dya-pass - 0
	(0x7 << 16),				/* dst_mask.  */
	FALSE),						/* pcrel_offset.  */

	HOWTO(R_ESP32ULP_I2C_RW_ADDR,	/* type.  */
	0,							/* rightshift.  */
	2,							/* size (0 = byte, 1 = short, 2 = long).  */
	16,							/* bitsize.  */
	FALSE,						/* pc_relative.  */
	0,							/* bitpos.  */
	complain_overflow_signed,	/* complain_on_overflow.  */
	NULL,						/* special_function.  */
	"R_ESP32ULP_I2C_RW_ADDR",		/* name.  */
	FALSE,						/* partial_inplace.  */
	0,							/* src_mask.  */ // dya-pass - 0
	(0xff << 0),				/* dst_mask.  */
	FALSE),						/* pcrel_offset.  */

	HOWTO(R_ESP32ULP_I2C_RW_DATA,	/* type.  */
	0,							/* rightshift.  */
	2,							/* size (0 = byte, 1 = short, 2 = long).  */
	16,							/* bitsize.  */
	FALSE,						/* pc_relative.  */
	8,							/* bitpos.  */
	complain_overflow_signed,	/* complain_on_overflow.  */
	NULL,						/* special_function.  */
	"R_ESP32ULP_I2C_RW_DATA",		/* name.  */
	FALSE,						/* partial_inplace.  */
	0,							/* src_mask.  */ // dya-pass - 0
	(0xff << 8),				/* dst_mask.  */
	FALSE),						/* pcrel_offset.  */

	HOWTO(R_ESP32ULP_I2C_RW_SEL,	/* type.  */
	0,							/* rightshift.  */
	2,							/* size (0 = byte, 1 = short, 2 = long).  */
	16,							/* bitsize.  */
	FALSE,						/* pc_relative.  */
	22,							/* bitpos.  */
	complain_overflow_signed,	/* complain_on_overflow.  */
	NULL,						/* special_function.  */
	"R_ESP32ULP_I2C_RW_SEL",		/* name.  */
	FALSE,						/* partial_inplace.  */
	0,							/* src_mask.  */ // dya-pass - 0
	(0xf << 22),				/* dst_mask.  */
	FALSE),						/* pcrel_offset.  */

	HOWTO(R_ESP32ULP_RESERVE,	/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	8,			/* bitsize.  */
	TRUE,			/* pc_relative.  */
	17,			/* bitpos.  */
	complain_overflow_signed, /* complain_on_overflow.  */
	esp32ulp_bfd_reloc,	/* special_function.  */
	"R_ESP32ULP_RESERVE",	/* name.  */
	FALSE,			/* partial_inplace.  */
	0,			  /* src_mask.  */
	0x01fe0000,		/* dst_mask.  */
	TRUE),			/* pcrel_offset.  */
};

static reloc_howto_type esp32ulp_gnuext_howto_table[] =
{
	HOWTO(R_ESP32ULP_PLTPC,		/* type.  */
	0,			/* rightshift.  */
	1,			/* size (0 = byte, 1 = short, 2 = long).  */
	16,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	0,			/* bitpos.  */
	complain_overflow_bitfield, /* complain_on_overflow.  */
	esp32ulp_pltpc_reloc,	/* special_function.  */
	"R_ESP32ULP_PLTPC",	/* name.  */
	FALSE,			/* partial_inplace.  */
	0xffff,		/* src_mask.  */
	0xffff,		/* dst_mask.  */
	FALSE),		/* pcrel_offset.  */

	HOWTO(R_ESP32ULP_GOT,		/* type.  */
	0,			/* rightshift.  */
	1,			/* size (0 = byte, 1 = short, 2 = long).  */
	16,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	0,			/* bitpos.  */
	complain_overflow_bitfield, /* complain_on_overflow.  */
	bfd_elf_generic_reloc,	/* special_function.  */
	"R_ESP32ULP_GOT",		/* name.  */
	FALSE,			/* partial_inplace.  */
	0x7fff,		/* src_mask.  */
	0x7fff,		/* dst_mask.  */
	FALSE),		/* pcrel_offset.  */

