espressif/binutils-esp32ulp/bfd/elf32-esp32ulp.c
/* Look through the relocs for a section during the first phase, and
allocate space in the global offset table or procedure linkage
table.  */

static bfd_boolean
esp32ulp_check_relocs(bfd * abfd,
struct bfd_link_info *info,
	asection *sec,
	const Elf_Internal_Rela *relocs)
{
	bfd *dynobj;
	Elf_Internal_Shdr *symtab_hdr;
	struct elf_link_hash_entry **sym_hashes;
	bfd_signed_vma *local_got_refcounts;
	const Elf_Internal_Rela *rel;
	const Elf_Internal_Rela *rel_end;
	asection *sgot;
	asection *srelgot;

	if (bfd_link_relocatable(info))
		return TRUE;

	dynobj = elf_hash_table(info)->dynobj;
	symtab_hdr = &elf_tdata(abfd)->symtab_hdr;
	sym_hashes = elf_sym_hashes(abfd);
	local_got_refcounts = elf_local_got_refcounts(abfd);

	sgot = NULL;
	srelgot = NULL;

	rel_end = relocs + sec->reloc_count;
	for (rel = relocs; rel < rel_end; rel++)
	{
		unsigned long r_symndx;
		struct elf_link_hash_entry *h;

		r_symndx = ELF32_R_SYM(rel->r_info);
		if (r_symndx < symtab_hdr->sh_info)
			h = NULL;
		else
		{
			h = sym_hashes[r_symndx - symtab_hdr->sh_info];

			/* PR15323, ref flags aren't set for references in the same
			object.  */
			h->root.non_ir_ref = 1;
		}

		switch (ELF32_R_TYPE(rel->r_info))
		{
			/* This relocation describes the C++ object vtable hierarchy.
			Reconstruct it for later use during GC.  */
		case R_ESP32ULP_GNU_VTINHERIT:
			if (!bfd_elf_gc_record_vtinherit(abfd, sec, h, rel->r_offset))
				return FALSE;
			break;

			/* This relocation describes which C++ vtable entries
			are actually used.  Record for later use during GC.  */
		case R_ESP32ULP_GNU_VTENTRY:
			BFD_ASSERT(h != NULL);
			if (h != NULL
				&& !bfd_elf_gc_record_vtentry(abfd, sec, h, rel->r_addend))
				return FALSE;
			break;

		case R_ESP32ULP_GOT:
			if (h != NULL
				&& strcmp(h->root.root.string, "__GLOBAL_OFFSET_TABLE_") == 0)
				break;
			/* Fall through.  */

			if (dynobj == NULL)
			{
				/* Create the .got section.  */
				elf_hash_table(info)->dynobj = dynobj = abfd;
				if (!_bfd_elf_create_got_section(dynobj, info))
					return FALSE;
			}

			sgot = elf_hash_table(info)->sgot;
			srelgot = elf_hash_table(info)->srelgot;
			BFD_ASSERT(sgot != NULL);

			if (h != NULL)
			{
				if (h->got.refcount == 0)
				{
					/* Make sure this symbol is output as a dynamic symbol.  */
					if (h->dynindx == -1 && !h->forced_local)
					{
						if (!bfd_elf_link_record_dynamic_symbol(info, h))
							return FALSE;
					}

					/* Allocate space in the .got section.  */
					sgot->size += 4;
					/* Allocate relocation space.  */
					srelgot->size += sizeof(Elf32_External_Rela);
				}
				h->got.refcount++;
			}
			else
			{
				/* This is a global offset table entry for a local symbol.  */
				if (local_got_refcounts == NULL)
				{
					bfd_size_type size;

					size = symtab_hdr->sh_info;
					size *= sizeof(bfd_signed_vma);
					local_got_refcounts = ((bfd_signed_vma *)
						bfd_zalloc(abfd, size));
					if (local_got_refcounts == NULL)
						return FALSE;
					elf_local_got_refcounts(abfd) = local_got_refcounts;
				}
				if (local_got_refcounts[r_symndx] == 0)
				{
					sgot->size += 4;
					if (bfd_link_pic(info))
					{
						/* If we are generating a shared object, we need to
						output a R_68K_RELATIVE reloc so that the dynamic
						linker can adjust this GOT entry.  */
						srelgot->size += sizeof(Elf32_External_Rela);
					}
				}
				local_got_refcounts[r_symndx]++;
			}
			break;

		default:
			break;
		}
	}

	return TRUE;
}

static enum elf_reloc_type_class
elf32_esp32ulp_reloc_type_class(const struct bfd_link_info *info ATTRIBUTE_UNUSED,
const asection *rel_sec ATTRIBUTE_UNUSED,
const Elf_Internal_Rela * rela)
{
	switch ((int)ELF32_R_TYPE(rela->r_info))
	{
	default:
		return reloc_class_normal;
	}
}

static bfd_reloc_status_type
esp32ulp_final_link_relocate(Elf_Internal_Rela *rel, reloc_howto_type *howto,
bfd *input_bfd, asection *input_section,
bfd_byte *contents, bfd_vma address,
bfd_vma value, bfd_vma addend)
{
	int r_type = ELF32_R_TYPE(rel->r_info);
	DEBUG_TRACE("dya_pass - esp32ulp_final_link_relocate r_type=%i, addend=%i\n", r_type, (unsigned int)addend);
	if ((r_type == R_ESP32ULP_JUMPR) || (r_type == R_ESP32ULP_JUMPR_STEP))
	{
		bfd_reloc_status_type r = bfd_reloc_ok;

		if (address > bfd_get_section_limit(input_bfd, input_section))
			return bfd_reloc_outofrange;

		value += addend;

		/* Perform usual pc-relative correction.  */
		value -= input_section->output_section->vma + input_section->output_offset;
		value -= address;

		unsigned int ddd = 0;
		memcpy(&ddd, contents + address, 4);
		ddd &= ~(0xff << 17);
		int compare = (int)value;
		if ((compare) >= 0)
		{
			ddd |= ((compare & 0x0000007f) << 17);
		}
		else
		{
			compare = -compare;
			ddd |= ((compare & 0x0000007f) << 17) | (1 << 24);
		}
		memcpy(contents + address, &ddd, 4);
		DEBUG_TRACE("dya_pass - esp32ulp_final_link_relocate: ddd=%08x, value=%08x, addr=%08x\n", ddd, (int)value, (int)address);
		return r;
	}

	return _bfd_final_link_relocate(howto, input_bfd, input_section, contents,
		rel->r_offset, value, addend);

}

static bfd_boolean
esp32ulp_relocate_section(bfd * output_bfd,
struct bfd_link_info *info,
	bfd * input_bfd,
	asection * input_section,
	bfd_byte * contents,
	Elf_Internal_Rela * relocs,
	Elf_Internal_Sym * local_syms,
	asection ** local_sections)
{
	bfd *dynobj;
	Elf_Internal_Shdr *symtab_hdr;
	struct elf_link_hash_entry **sym_hashes;
	bfd_vma *local_got_offsets;
	asection *sgot;
	Elf_Internal_Rela *rel;
	Elf_Internal_Rela *relend;
	int i = 0;

	dynobj = elf_hash_table(info)->dynobj;
	symtab_hdr = &elf_tdata(input_bfd)->symtab_hdr;
	sym_hashes = elf_sym_hashes(input_bfd);
	local_got_offsets = elf_local_got_offsets(input_bfd);

	sgot = NULL;

	rel = relocs;
	relend = relocs + input_section->reloc_count;
	DEBUG_TRACE("dya_pass - esp32ulp_relocate_section\n");
	for (; rel < relend; rel++, i++)
	{
		int r_type;
		reloc_howto_type *howto;
		unsigned long r_symndx;
		struct elf_link_hash_entry *h;
		Elf_Internal_Sym *sym;
		asection *sec;
		bfd_vma relocation = 0;
		bfd_boolean unresolved_reloc;
		bfd_reloc_status_type r;
		bfd_vma address;

		r_type = ELF32_R_TYPE(rel->r_info);
		if (r_type < 0 || r_type >= 243)
		{
			bfd_set_error(bfd_error_bad_value);
			return FALSE;
		}

		if (r_type == R_ESP32ULP_GNU_VTENTRY
			|| r_type == R_ESP32ULP_GNU_VTINHERIT)
			continue;

		howto = esp32ulp_reloc_type_lookup(input_bfd, r_type);
		if (howto == NULL)
		{
			bfd_set_error(bfd_error_bad_value);
			return FALSE;
		}
		r_symndx = ELF32_R_SYM(rel->r_info);

		h = NULL;
		sym = NULL;
		sec = NULL;
		unresolved_reloc = FALSE;

		if (r_symndx < symtab_hdr->sh_info)
		{
			sym = local_syms + r_symndx;
			sec = local_sections[r_symndx];
			relocation = _bfd_elf_rela_local_sym(output_bfd, sym, &sec, rel);
		}
		else
		{
			bfd_boolean warned, ignored;

