espressif/binutils-esp32ulp/bfd/elf32-esp32ulp.c
			RELOC_FOR_GLOBAL_SYMBOL(info, input_bfd, input_section, rel,
				r_symndx, symtab_hdr, sym_hashes,
				h, sec, relocation,
				unresolved_reloc, warned, ignored);
		}

		if (sec != NULL && discarded_section(sec))
			RELOC_AGAINST_DISCARDED_SECTION(info, input_bfd, input_section,
			rel, 1, relend, howto, 0, contents);

		if (bfd_link_relocatable(info))
			continue;

		address = rel->r_offset;

		/* Then, process normally.  */
		DEBUG_TRACE("dya_pass - esp32ulp_relocate_section r_type=%i\n", (int)r_type);
		switch (r_type)
		{
		case R_ESP32ULP_GNU_VTINHERIT:
		case R_ESP32ULP_GNU_VTENTRY:
			return bfd_reloc_ok;

		case R_ESP32ULP_GOT:
			/* Relocation is to the address of the entry for this symbol
			in the global offset table.  */
			if (h != NULL
				&& strcmp(h->root.root.string, "__GLOBAL_OFFSET_TABLE_") == 0)
				goto do_default;
			/* Fall through.  */
			/* Relocation is the offset of the entry for this symbol in
			the global offset table.  */

			{
				bfd_vma off;

				if (dynobj == NULL)
				{
					/* Create the .got section.  */
					elf_hash_table(info)->dynobj = dynobj = output_bfd;
					if (!_bfd_elf_create_got_section(dynobj, info))
						return FALSE;
				}

				sgot = elf_hash_table(info)->sgot;
				BFD_ASSERT(sgot != NULL);

				if (h != NULL)
				{
					bfd_boolean dyn;

					off = h->got.offset;
					BFD_ASSERT(off != (bfd_vma)-1);
					dyn = elf_hash_table(info)->dynamic_sections_created;

					if (!WILL_CALL_FINISH_DYNAMIC_SYMBOL(dyn,
						bfd_link_pic(info),
						h)
						|| (bfd_link_pic(info)
						&& (info->symbolic
						|| h->dynindx == -1
						|| h->forced_local)
						&& h->def_regular))
					{
						/* This is actually a static link, or it is a
						-Bsymbolic link and the symbol is defined
						locally, or the symbol was forced to be local
						because of a version file..  We must initialize
						this entry in the global offset table.  Since
						the offset must always be a multiple of 4, we
						use the least significant bit to record whether
						we have initialized it already.

						When doing a dynamic link, we create a .rela.got
						relocation entry to initialize the value.  This
						is done in the finish_dynamic_symbol routine.  */
						if ((off & 1) != 0)
							off &= ~1;
						else
						{
							bfd_put_32(output_bfd, relocation,
								sgot->contents + off);
							h->got.offset |= 1;
						}
					}
					else
						unresolved_reloc = FALSE;
				}
				else
				{
					BFD_ASSERT(local_got_offsets != NULL);
					off = local_got_offsets[r_symndx];
					BFD_ASSERT(off != (bfd_vma)-1);

					/* The offset must always be a multiple of 4.  We use
					the least significant bit to record whether we have
					already generated the necessary reloc.  */
					if ((off & 1) != 0)
						off &= ~1;
					else
					{
						bfd_put_32(output_bfd, relocation, sgot->contents + off);

						if (bfd_link_pic(info))
						{
							asection *s;
							Elf_Internal_Rela outrel;
							bfd_byte *loc;

							s = elf_hash_table(info)->srelgot;
							BFD_ASSERT(s != NULL);

							outrel.r_offset = (sgot->output_section->vma
								+ sgot->output_offset + off);
							outrel.r_info =
								ELF32_R_INFO(0, R_ESP32ULP_RIMM16);
							outrel.r_addend = relocation;
							loc = s->contents;
							loc +=
								s->reloc_count++ * sizeof(Elf32_External_Rela);
							bfd_elf32_swap_reloca_out(output_bfd, &outrel, loc);
						}

						local_got_offsets[r_symndx] |= 1;
					}
				}

				relocation = sgot->output_offset + off;
				rel->r_addend = 0;
				/* esp32ulp : preg = [preg + 17bitdiv4offset] relocation is div by 4.  */
				relocation /= 4;
			}
			goto do_default;

		default:
		do_default :
			DEBUG_TRACE("dya_pass esp32ulp_final_link_relocate rel->r_addend=%i\n", (int)rel->r_addend);
				   rel->r_addend = 0; // dya_pass
				   r = esp32ulp_final_link_relocate(rel, howto, input_bfd, input_section,
					   contents, address,
					   relocation, rel->r_addend);

				   break;
		}

		/* Dynamic relocs are not propagated for SEC_DEBUGGING sections
		because such sections are not SEC_ALLOC and thus ld.so will
		not process them.  */
		if (unresolved_reloc
			&& !((input_section->flags & SEC_DEBUGGING) != 0 && h->def_dynamic)
			&& _bfd_elf_section_offset(output_bfd, info, input_section,
			rel->r_offset) != (bfd_vma)-1)
		{
			_bfd_error_handler
				/* xgettext:c-format */
				(_("%B(%A+0x%lx): unresolvable relocation against symbol `%s'"),
				input_bfd,
				input_section, (long)rel->r_offset, h->root.root.string);
			return FALSE;
		}

		if (r != bfd_reloc_ok)
		{
			const char *name;

			if (h != NULL)
				name = h->root.root.string;
			else
			{
				name = bfd_elf_string_from_elf_section(input_bfd,
					symtab_hdr->sh_link,
					sym->st_name);
				if (name == NULL)
					return FALSE;
				if (*name == '\0')
					name = bfd_section_name(input_bfd, sec);
			}

			if (r == bfd_reloc_overflow)
				(*info->callbacks->reloc_overflow)
				(info, (h ? &h->root : NULL), name, howto->name,
				(bfd_vma)0, input_bfd, input_section, rel->r_offset);
			else
			{
				_bfd_error_handler
					/* xgettext:c-format */
					(_("%B(%A+0x%lx): reloc against `%s': error %d"),
					input_bfd, input_section,
					(long)rel->r_offset, name, (int)r);
				return FALSE;
			}
		}
	}

	return TRUE;
}

static asection *
esp32ulp_gc_mark_hook(asection * sec,
struct bfd_link_info *info,
	Elf_Internal_Rela * rel,
struct elf_link_hash_entry *h,
	Elf_Internal_Sym * sym)
{
	if (h != NULL)
		switch (ELF32_R_TYPE(rel->r_info))
	{
		case R_ESP32ULP_GNU_VTINHERIT:
		case R_ESP32ULP_GNU_VTENTRY:
			return NULL;
	}

	return _bfd_elf_gc_mark_hook(sec, info, rel, h, sym);
}

/* Update the got entry reference counts for the section being removed.  */

static bfd_boolean
esp32ulp_gc_sweep_hook(bfd * abfd,
struct bfd_link_info *info,
	asection * sec,
	const Elf_Internal_Rela * relocs)
{
	Elf_Internal_Shdr *symtab_hdr;
	struct elf_link_hash_entry **sym_hashes;
	bfd_signed_vma *local_got_refcounts;
	const Elf_Internal_Rela *rel, *relend;
	bfd *dynobj;
	asection *sgot;
	asection *srelgot;

	dynobj = elf_hash_table(info)->dynobj;
	if (dynobj == NULL)
		return TRUE;

