espressif/binutils-esp32ulp/bfd/elf32-esp32ulp.c
	return TRUE;
}

/* Update the relocation information for the relocations of the section
being removed.  */

static bfd_boolean
esp32ulpfdpic_gc_sweep_hook(bfd *abfd,
struct bfd_link_info *info,
	asection *sec,
	const Elf_Internal_Rela *relocs)
{
	Elf_Internal_Shdr *symtab_hdr;
	struct elf_link_hash_entry **sym_hashes, **sym_hashes_end;
	const Elf_Internal_Rela *rel;
	const Elf_Internal_Rela *rel_end;
	struct esp32ulpfdpic_relocs_info *picrel;

	BFD_ASSERT(IS_FDPIC(abfd));

	symtab_hdr = &elf_tdata(abfd)->symtab_hdr;
	sym_hashes = elf_sym_hashes(abfd);
	sym_hashes_end = sym_hashes + symtab_hdr->sh_size / sizeof(Elf32_External_Sym);
	if (!elf_bad_symtab(abfd))
		sym_hashes_end -= symtab_hdr->sh_info;

	rel_end = relocs + sec->reloc_count;
	for (rel = relocs; rel < rel_end; rel++)
	{
		struct elf_link_hash_entry *h;
		unsigned long r_symndx;

		r_symndx = ELF32_R_SYM(rel->r_info);
		if (r_symndx < symtab_hdr->sh_info)
			h = NULL;
		else
			h = sym_hashes[r_symndx - symtab_hdr->sh_info];

		if (h != NULL)
			picrel = esp32ulpfdpic_relocs_info_for_global(esp32ulpfdpic_relocs_info(info),
			abfd, h,
			rel->r_addend, NO_INSERT);
		else
			picrel = esp32ulpfdpic_relocs_info_for_local(esp32ulpfdpic_relocs_info
			(info), abfd, r_symndx,
			rel->r_addend, NO_INSERT);

		if (!picrel)
			return TRUE;
	}

	return TRUE;
}

/* We need dynamic symbols for every section, since segments can
relocate independently.  */
static bfd_boolean
_esp32ulpfdpic_link_omit_section_dynsym(bfd *output_bfd ATTRIBUTE_UNUSED,
struct bfd_link_info *info ATTRIBUTE_UNUSED,
	asection *p)
{
	switch (elf_section_data(p)->this_hdr.sh_type)
	{
	case SHT_PROGBITS:
	case SHT_NOBITS:
		/* If sh_type is yet undecided, assume it could be
		SHT_PROGBITS/SHT_NOBITS.  */
	case SHT_NULL:
		return FALSE;

		/* There shouldn't be section relative relocations
		against any other section.  */
	default:
		return TRUE;
	}
}

/* Create  a .got section, as well as its additional info field.  This
is almost entirely copied from
elflink.c:_bfd_elf_create_got_section().  */

static bfd_boolean
_esp32ulp_create_got_section(bfd *abfd, struct bfd_link_info *info)
{
	flagword flags, pltflags;
	asection *s;
	struct elf_link_hash_entry *h;
	const struct elf_backend_data *bed = get_elf_backend_data(abfd);
	int ptralign;

	/* This function may be called more than once.  */
	s = elf_hash_table(info)->sgot;
	if (s != NULL)
		return TRUE;

	/* Machine specific: although pointers are 32-bits wide, we want the
	GOT to be aligned to a 64-bit boundary, such that function
	descriptors in it can be accessed with 64-bit loads and
	stores.  */
	ptralign = 3;

	flags = (SEC_ALLOC | SEC_LOAD | SEC_HAS_CONTENTS | SEC_IN_MEMORY
		| SEC_LINKER_CREATED);
	pltflags = flags;

	s = bfd_make_section_anyway_with_flags(abfd, ".got", flags);
	elf_hash_table(info)->sgot = s;
	if (s == NULL
		|| !bfd_set_section_alignment(abfd, s, ptralign))
		return FALSE;

	if (bed->want_got_sym)
	{
		/* Define the symbol _GLOBAL_OFFSET_TABLE_ at the start of the .got
		(or .got.plt) section.  We don't do this in the linker script
		because we don't want to define the symbol if we are not creating
		a global offset table.  */
		h = _bfd_elf_define_linkage_sym(abfd, info, s, "__GLOBAL_OFFSET_TABLE_");
		elf_hash_table(info)->hgot = h;
		if (h == NULL)
			return FALSE;

		/* Machine-specific: we want the symbol for executables as
		well.  */
		if (!bfd_elf_link_record_dynamic_symbol(info, h))
			return FALSE;
	}

	/* The first bit of the global offset table is the header.  */
	s->size += bed->got_header_size;

	/* This is the machine-specific part.  Create and initialize section
	data for the got.  */
	if (IS_FDPIC(abfd))
	{
		esp32ulpfdpic_relocs_info(info) = htab_try_create(1,
			esp32ulpfdpic_relocs_info_hash,
			esp32ulpfdpic_relocs_info_eq,
			(htab_del)NULL);
		if (!esp32ulpfdpic_relocs_info(info))
			return FALSE;

		s = bfd_make_section_anyway_with_flags(abfd, ".rel.got",
			(flags | SEC_READONLY));
		if (s == NULL
			|| !bfd_set_section_alignment(abfd, s, 2))
			return FALSE;

		esp32ulpfdpic_gotrel_section(info) = s;

		/* Machine-specific.  */
		s = bfd_make_section_anyway_with_flags(abfd, ".rofixup",
			(flags | SEC_READONLY));
		if (s == NULL
			|| !bfd_set_section_alignment(abfd, s, 2))
			return FALSE;

		esp32ulpfdpic_gotfixup_section(info) = s;
	}

	pltflags |= SEC_CODE;
	if (bed->plt_not_loaded)
		pltflags &= ~(SEC_CODE | SEC_LOAD | SEC_HAS_CONTENTS);
	if (bed->plt_readonly)
		pltflags |= SEC_READONLY;

	s = bfd_make_section_anyway_with_flags(abfd, ".plt", pltflags);
	if (s == NULL
		|| !bfd_set_section_alignment(abfd, s, bed->plt_alignment))
		return FALSE;
	/* Blackfin-specific: remember it.  */
	esp32ulpfdpic_plt_section(info) = s;

	if (bed->want_plt_sym)
	{
		/* Define the symbol _PROCEDURE_LINKAGE_TABLE_ at the start of the
		.plt section.  */
		struct bfd_link_hash_entry *bh = NULL;

		if (!(_bfd_generic_link_add_one_symbol
			(info, abfd, "__PROCEDURE_LINKAGE_TABLE_", BSF_GLOBAL, s, 0, NULL,
			FALSE, get_elf_backend_data(abfd)->collect, &bh)))
			return FALSE;
		h = (struct elf_link_hash_entry *) bh;
		h->def_regular = 1;
		h->type = STT_OBJECT;

		if (!bfd_link_executable(info)
			&& !bfd_elf_link_record_dynamic_symbol(info, h))
			return FALSE;
	}

	/* Blackfin-specific: we want rel relocations for the plt.  */
	s = bfd_make_section_anyway_with_flags(abfd, ".rel.plt",
		flags | SEC_READONLY);
	if (s == NULL
		|| !bfd_set_section_alignment(abfd, s, bed->s->log_file_align))
		return FALSE;
	/* Blackfin-specific: remember it.  */
	esp32ulpfdpic_pltrel_section(info) = s;

	return TRUE;
}

/* Make sure the got and plt sections exist, and that our pointers in
the link hash table point to them.  */

static bfd_boolean
elf32_esp32ulpfdpic_create_dynamic_sections(bfd *abfd, struct bfd_link_info *info)
{
	/* This is mostly copied from
	elflink.c:_bfd_elf_create_dynamic_sections().  */
	flagword flags;
	asection *s;
	const struct elf_backend_data *bed = get_elf_backend_data(abfd);

	flags = (SEC_ALLOC | SEC_LOAD | SEC_HAS_CONTENTS | SEC_IN_MEMORY
		| SEC_LINKER_CREATED);

	/* We need to create .plt, .rel[a].plt, .got, .got.plt, .dynbss, and
	.rel[a].bss sections.  */

	/* Blackfin-specific: we want to create the GOT in the Blackfin way.  */
	if (!_esp32ulp_create_got_section(abfd, info))
		return FALSE;

	/* Blackfin-specific: make sure we created everything we wanted.  */
	BFD_ASSERT(esp32ulpfdpic_got_section(info) && esp32ulpfdpic_gotrel_section(info)
		/* && esp32ulpfdpic_gotfixup_section (info) */
		&& esp32ulpfdpic_plt_section(info)
		&& esp32ulpfdpic_pltrel_section(info));

	if (bed->want_dynbss)
	{
		/* The .dynbss section is a place to put symbols which are defined
		by dynamic objects, are referenced by regular objects, and are
		not functions.  We must allocate space for them in the process
		image and use a R_*_COPY reloc to tell the dynamic linker to
		initialize them at run time.  The linker script puts the .dynbss
		section into the .bss section of the final image.  */
		s = bfd_make_section_anyway_with_flags(abfd, ".dynbss",
			SEC_ALLOC | SEC_LINKER_CREATED);
		if (s == NULL)
			return FALSE;

		/* The .rel[a].bss section holds copy relocs.  This section is not
		normally needed.  We need to create it here, though, so that the
		linker will map it to an output section.  We can't just create it
		only if we need it, because we will not know whether we need it
		until we have seen all the input files, and the first time the
		main linker code calls BFD after examining all the input files
		(size_dynamic_sections) the input sections have already been
		mapped to the output sections.  If the section turns out not to
		be needed, we can discard it later.  We will never need this
		section when generating a shared object, since they do not use
		copy relocs.  */
		if (!bfd_link_pic(info))
		{
			s = bfd_make_section_anyway_with_flags(abfd,
				".rela.bss",
				flags | SEC_READONLY);
			if (s == NULL
				|| !bfd_set_section_alignment(abfd, s, bed->s->log_file_align))
				return FALSE;
		}
	}

