espressif/binutils-esp32ulp/bfd/elf32-esp32ulp.c
	return TRUE;
}

/* Compute the total GOT size required by each symbol in each range.
Symbols may require up to 4 words in the GOT: an entry pointing to
the symbol, an entry pointing to its function descriptor, and a
private function descriptors taking two words.  */

static void
_esp32ulpfdpic_count_nontls_entries(struct esp32ulpfdpic_relocs_info *entry,
struct _esp32ulpfdpic_dynamic_got_info *dinfo)
{
	/* Allocate space for a GOT entry pointing to the symbol.  */
	if (entry->got17m4)
		dinfo->got17m4 += 4;
	else if (entry->gothilo)
		dinfo->gothilo += 4;
	else
		entry->relocs32--;
	entry->relocs32++;

	/* Allocate space for a GOT entry pointing to the function
	descriptor.  */
	if (entry->fdgot17m4)
		dinfo->got17m4 += 4;
	else if (entry->fdgothilo)
		dinfo->gothilo += 4;
	else
		entry->relocsfd--;
	entry->relocsfd++;

	/* Decide whether we need a PLT entry, a function descriptor in the
	GOT, and a lazy PLT entry for this symbol.  */
	entry->plt = entry->call
		&& entry->symndx == -1 && !ESP32ULPFDPIC_SYM_LOCAL(dinfo->info, entry->d.h)
		&& elf_hash_table(dinfo->info)->dynamic_sections_created;
	entry->privfd = entry->plt
		|| entry->fdgoff17m4 || entry->fdgoffhilo
		|| ((entry->fd || entry->fdgot17m4 || entry->fdgothilo)
		&& (entry->symndx != -1
		|| ESP32ULPFDPIC_FUNCDESC_LOCAL(dinfo->info, entry->d.h)));
	entry->lazyplt = entry->privfd
		&& entry->symndx == -1 && !ESP32ULPFDPIC_SYM_LOCAL(dinfo->info, entry->d.h)
		&& !(dinfo->info->flags & DF_BIND_NOW)
		&& elf_hash_table(dinfo->info)->dynamic_sections_created;

	/* Allocate space for a function descriptor.  */
	if (entry->fdgoff17m4)
		dinfo->fd17m4 += 8;
	else if (entry->privfd && entry->plt)
		dinfo->fdplt += 8;
	else if (entry->privfd)
		dinfo->fdhilo += 8;
	else
		entry->relocsfdv--;
	entry->relocsfdv++;

	if (entry->lazyplt)
		dinfo->lzplt += LZPLT_NORMAL_SIZE;
}

/* Compute the number of dynamic relocations and fixups that a symbol
requires, and add (or subtract) from the grand and per-symbol
totals.  */

static void
_esp32ulpfdpic_count_relocs_fixups(struct esp32ulpfdpic_relocs_info *entry,
struct _esp32ulpfdpic_dynamic_got_info *dinfo,
	bfd_boolean subtract)
{
	bfd_vma relocs = 0, fixups = 0;

	if (!bfd_link_pde(dinfo->info))
		relocs = entry->relocs32 + entry->relocsfd + entry->relocsfdv;
	else
	{
		if (entry->symndx != -1 || ESP32ULPFDPIC_SYM_LOCAL(dinfo->info, entry->d.h))
		{
			if (entry->symndx != -1
				|| entry->d.h->root.type != bfd_link_hash_undefweak)
				fixups += entry->relocs32 + 2 * entry->relocsfdv;
		}
		else
			relocs += entry->relocs32 + entry->relocsfdv;

		if (entry->symndx != -1
			|| ESP32ULPFDPIC_FUNCDESC_LOCAL(dinfo->info, entry->d.h))
		{
			if (entry->symndx != -1
				|| entry->d.h->root.type != bfd_link_hash_undefweak)
				fixups += entry->relocsfd;
		}
		else
			relocs += entry->relocsfd;
	}

	if (subtract)
	{
		relocs = -relocs;
		fixups = -fixups;
	}

	entry->dynrelocs += relocs;
	entry->fixups += fixups;
	dinfo->relocs += relocs;
	dinfo->fixups += fixups;
}

/* Compute the total GOT and PLT size required by each symbol in each range. *
Symbols may require up to 4 words in the GOT: an entry pointing to
the symbol, an entry pointing to its function descriptor, and a
private function descriptors taking two words.  */

static int
_esp32ulpfdpic_count_got_plt_entries(void **entryp, void *dinfo_)
{
	struct esp32ulpfdpic_relocs_info *entry = *entryp;
	struct _esp32ulpfdpic_dynamic_got_info *dinfo = dinfo_;

	_esp32ulpfdpic_count_nontls_entries(entry, dinfo);

	_esp32ulpfdpic_count_relocs_fixups(entry, dinfo, FALSE);

	return 1;
}

/* This structure is used to assign offsets to got entries, function
descriptors, plt entries and lazy plt entries.  */

struct _esp32ulpfdpic_dynamic_got_plt_info
{
	/* Summary information collected with _esp32ulpfdpic_count_got_plt_entries.  */
	struct _esp32ulpfdpic_dynamic_got_info g;

	/* For each addressable range, we record a MAX (positive) and MIN
	(negative) value.  CUR is used to assign got entries, and it's
	incremented from an initial positive value to MAX, then from MIN
	to FDCUR (unless FDCUR wraps around first).  FDCUR is used to
	assign function descriptors, and it's decreased from an initial
	non-positive value to MIN, then from MAX down to CUR (unless CUR
	wraps around first).  All of MIN, MAX, CUR and FDCUR always point
	to even words.  ODD, if non-zero, indicates an odd word to be
	used for the next got entry, otherwise CUR is used and
	incremented by a pair of words, wrapping around when it reaches
	MAX.  FDCUR is decremented (and wrapped) before the next function
	descriptor is chosen.  FDPLT indicates the number of remaining
	slots that can be used for function descriptors used only by PLT
	entries.  */
	struct _esp32ulpfdpic_dynamic_got_alloc_data
	{
		bfd_signed_vma max, cur, odd, fdcur, min;
		bfd_vma fdplt;
	} got17m4, gothilo;
};

/* Determine the positive and negative ranges to be used by each
offset range in the GOT.  FDCUR and CUR, that must be aligned to a
double-word boundary, are the minimum (negative) and maximum
(positive) GOT offsets already used by previous ranges, except for
an ODD entry that may have been left behind.  GOT and FD indicate
the size of GOT entries and function descriptors that must be
placed within the range from -WRAP to WRAP.  If there's room left,
up to FDPLT bytes should be reserved for additional function
descriptors.  */

inline static bfd_signed_vma
_esp32ulpfdpic_compute_got_alloc_data(struct _esp32ulpfdpic_dynamic_got_alloc_data *gad,
bfd_signed_vma fdcur,
bfd_signed_vma odd,
bfd_signed_vma cur,
bfd_vma got,
bfd_vma fd,
bfd_vma fdplt,
bfd_vma wrap)
{
	bfd_signed_vma wrapmin = -wrap;

	/* Start at the given initial points.  */
	gad->fdcur = fdcur;
	gad->cur = cur;

	/* If we had an incoming odd word and we have any got entries that
	are going to use it, consume it, otherwise leave gad->odd at
	zero.  We might force gad->odd to zero and return the incoming
	odd such that it is used by the next range, but then GOT entries
	might appear to be out of order and we wouldn't be able to
	shorten the GOT by one word if it turns out to end with an
	unpaired GOT entry.  */
	if (odd && got)
	{
		gad->odd = odd;
		got -= 4;
		odd = 0;
	}
	else
		gad->odd = 0;

