espressif/binutils-esp32ulp/bfd/elf32-esp32ulp.c
	if (bfd_link_relocatable(info))
		return TRUE;

	symtab_hdr = &elf_tdata(abfd)->symtab_hdr;
	sym_hashes = elf_sym_hashes(abfd);

	rel_end = relocs + sec->reloc_count;
	for (rel = relocs; rel < rel_end; rel++)
	{
		struct elf_link_hash_entry *h;
		unsigned long r_symndx;

		r_symndx = ELF32_R_SYM(rel->r_info);
		if (r_symndx < symtab_hdr->sh_info)
			h = NULL;
		else
			h = sym_hashes[r_symndx - symtab_hdr->sh_info];

		switch (ELF32_R_TYPE(rel->r_info))
		{
			/* This relocation describes the C++ object vtable hierarchy.
			Reconstruct it for later use during GC.  */
		case R_ESP32ULP_GNU_VTINHERIT:
			if (!bfd_elf_gc_record_vtinherit(abfd, sec, h, rel->r_offset))
				return FALSE;
			break;

			/* This relocation describes which C++ vtable entries are actually
			used.  Record for later use during GC.  */
		case R_ESP32ULP_GNU_VTENTRY:
			BFD_ASSERT(h != NULL);
			if (h != NULL
				&& !bfd_elf_gc_record_vtentry(abfd, sec, h, rel->r_addend))
				return FALSE;
			break;

		case R_ESP32ULP_JUMPR:
			break;

		default:
			_bfd_error_handler
				/* xgettext:c-format */
				(_("%B: unsupported relocation type %i"),
				abfd, ELF32_R_TYPE(rel->r_info));
			return FALSE;
		}
	}

	return TRUE;
}

/* Set the right machine number for a Blackfin ELF file.  */

static bfd_boolean
elf32_esp32ulp_object_p(bfd *abfd)
{
	bfd_default_set_arch_mach(abfd, bfd_arch_esp32ulp, 0);
	return (((elf_elfheader(abfd)->e_flags & EF_ESP32ULP_FDPIC) != 0)
		== (IS_FDPIC(abfd)));
}

static bfd_boolean
elf32_esp32ulp_set_private_flags(bfd * abfd, flagword flags)
{
	elf_elfheader(abfd)->e_flags = flags;
	elf_flags_init(abfd) = TRUE;
	return TRUE;
}

/* Display the flags field.  */
static bfd_boolean
elf32_esp32ulp_print_private_bfd_data(bfd * abfd, void * ptr)
{
	FILE *file = (FILE *)ptr;
	flagword flags;

	BFD_ASSERT(abfd != NULL && ptr != NULL);

	/* Print normal ELF private data.  */
	_bfd_elf_print_private_bfd_data(abfd, ptr);

	flags = elf_elfheader(abfd)->e_flags;

	/* xgettext:c-format */
	fprintf(file, _("private flags = %lx:"), elf_elfheader(abfd)->e_flags);

	if (flags & EF_ESP32ULP_PIC)
		fprintf(file, " -fpic");

	if (flags & EF_ESP32ULP_FDPIC)
		fprintf(file, " -mfdpic");

	fputc('\n', file);

	return TRUE;
}

/* Merge backend specific data from an object file to the output
object file when linking.  */

static bfd_boolean
elf32_esp32ulp_merge_private_bfd_data(bfd *ibfd, struct bfd_link_info *info)
{
	bfd *obfd = info->output_bfd;
	flagword old_flags, new_flags;
	bfd_boolean error = FALSE;

	new_flags = elf_elfheader(ibfd)->e_flags;
	old_flags = elf_elfheader(obfd)->e_flags;

	if (new_flags & EF_ESP32ULP_FDPIC)
		new_flags &= ~EF_ESP32ULP_PIC;

#ifndef DEBUG
	if (0)
#endif
		_bfd_error_handler
		("old_flags = 0x%.8lx, new_flags = 0x%.8lx, init = %s, filename = %s",
		old_flags, new_flags, elf_flags_init(obfd) ? "yes" : "no",
		bfd_get_filename(ibfd));

	if (!elf_flags_init(obfd))			/* First call, no flags set.  */
	{
		elf_flags_init(obfd) = TRUE;
		elf_elfheader(obfd)->e_flags = new_flags;
	}

	if (((new_flags & EF_ESP32ULP_FDPIC) == 0) != (!IS_FDPIC(obfd)))
	{
		error = TRUE;
		if (IS_FDPIC(obfd))
			_bfd_error_handler
			(_("%s: cannot link non-fdpic object file into fdpic executable"),
			bfd_get_filename(ibfd));
		else
			_bfd_error_handler
			(_("%s: cannot link fdpic object file into non-fdpic executable"),
			bfd_get_filename(ibfd));
	}

	if (error)
		bfd_set_error(bfd_error_bad_value);

	return !error;
}

/* esp32ulp ELF linker hash entry.  */

struct esp32ulp_link_hash_entry
{
	struct elf_link_hash_entry root;

	/* Number of PC relative relocs copied for this symbol.  */
	struct esp32ulp_pcrel_relocs_copied *pcrel_relocs_copied;
};

/* esp32ulp ELF linker hash table.  */

struct esp32ulp_link_hash_table
{
	struct elf_link_hash_table root;

	/* Small local sym cache.  */
	struct sym_cache sym_cache;
};

#define esp32ulp_hash_entry(ent) ((struct esp32ulp_link_hash_entry *) (ent))

static struct bfd_hash_entry *
esp32ulp_link_hash_newfunc(struct bfd_hash_entry *entry,
struct bfd_hash_table *table, const char *string)
{
	struct bfd_hash_entry *ret = entry;

	/* Allocate the structure if it has not already been allocated by a
	subclass.  */
	if (ret == NULL)
		ret = bfd_hash_allocate(table, sizeof(struct esp32ulp_link_hash_entry));
	if (ret == NULL)
		return ret;

	/* Call the allocation method of the superclass.  */
	ret = _bfd_elf_link_hash_newfunc(ret, table, string);
	if (ret != NULL)
		esp32ulp_hash_entry(ret)->pcrel_relocs_copied = NULL;

	return ret;
}

/* Create an esp32ulp ELF linker hash table.  */

static struct bfd_link_hash_table *
esp32ulp_link_hash_table_create(bfd * abfd)
{
	struct esp32ulp_link_hash_table *ret;
	bfd_size_type amt = sizeof(struct esp32ulp_link_hash_table);

	ret = bfd_zmalloc(amt);
	if (ret == NULL)
		return NULL;

	if (!_bfd_elf_link_hash_table_init(&ret->root, abfd,
		esp32ulp_link_hash_newfunc,
		sizeof(struct elf_link_hash_entry),
		ESP32ULP_ELF_DATA))
	{
		free(ret);
		return NULL;
	}

	ret->sym_cache.abfd = NULL;

	return &ret->root.root;
}

/* The size in bytes of an entry in the procedure linkage table.  */

/* Finish up the dynamic sections.  */

static bfd_boolean
esp32ulp_finish_dynamic_sections(bfd * output_bfd ATTRIBUTE_UNUSED,
struct bfd_link_info *info)
{
	bfd *dynobj;
	asection *sdyn;

	dynobj = elf_hash_table(info)->dynobj;

	sdyn = bfd_get_linker_section(dynobj, ".dynamic");

	if (elf_hash_table(info)->dynamic_sections_created)
	{
		Elf32_External_Dyn *dyncon, *dynconend;

		BFD_ASSERT(sdyn != NULL);

		dyncon = (Elf32_External_Dyn *)sdyn->contents;
		dynconend = (Elf32_External_Dyn *)(sdyn->contents + sdyn->size);
		for (; dyncon < dynconend; dyncon++)
		{
			Elf_Internal_Dyn dyn;

			bfd_elf32_swap_dyn_in(dynobj, dyncon, &dyn);

		}

	}
	return TRUE;
}

/* Finish up dynamic symbol handling.  We set the contents of various
dynamic sections here.  */

static bfd_boolean
esp32ulp_finish_dynamic_symbol(bfd * output_bfd,
struct bfd_link_info *info,
struct elf_link_hash_entry *h,
	Elf_Internal_Sym * sym)
{
	if (h->got.offset != (bfd_vma)-1)
	{
		asection *sgot;
		asection *srela;
		Elf_Internal_Rela rela;
		bfd_byte *loc;

		/* This symbol has an entry in the global offset table.
		Set it up.  */

		sgot = elf_hash_table(info)->sgot;
		srela = elf_hash_table(info)->srelgot;
		BFD_ASSERT(sgot != NULL && srela != NULL);

