espressif/binutils-esp32ulp/bfd/elf32-esp32ulp.c
		rela.r_offset = (sgot->output_section->vma
			+ sgot->output_offset
			+ (h->got.offset & ~(bfd_vma)1));

		/* If this is a -Bsymbolic link, and the symbol is defined
		locally, we just want to emit a RELATIVE reloc.  Likewise if
		the symbol was forced to be local because of a version file.
		The entry in the global offset table will already have been
		initialized in the relocate_section function.  */
		if (bfd_link_pic(info)
			&& (info->symbolic
			|| h->dynindx == -1 || h->forced_local) && h->def_regular)
		{
			_bfd_error_handler(_("*** check this relocation %s"),
				__FUNCTION__);
			rela.r_info = ELF32_R_INFO(0, R_ESP32ULP_RIMM16);
			rela.r_addend = bfd_get_signed_32(output_bfd,
				(sgot->contents
				+
				(h->got.
				offset & ~(bfd_vma)1)));
		}
		else
		{
			bfd_put_32(output_bfd, (bfd_vma)0,
				sgot->contents + (h->got.offset & ~(bfd_vma)1));
			rela.r_info = ELF32_R_INFO(h->dynindx, R_ESP32ULP_GOT);
			rela.r_addend = 0;
		}

		loc = srela->contents;
		loc += srela->reloc_count++ * sizeof(Elf32_External_Rela);
		bfd_elf32_swap_reloca_out(output_bfd, &rela, loc);
	}

	if (h->needs_copy)
	{
		BFD_ASSERT(0);
	}
	/* Mark _DYNAMIC and _GLOBAL_OFFSET_TABLE_ as absolute.  */
	if (strcmp(h->root.root.string, "__DYNAMIC") == 0
		|| h == elf_hash_table(info)->hgot)
		sym->st_shndx = SHN_ABS;

	return TRUE;
}

/* Adjust a symbol defined by a dynamic object and referenced by a
regular object.  The current definition is in some section of the
dynamic object, but we're not including those sections.  We have to
change the definition to something the rest of the link can
understand.  */

static bfd_boolean
esp32ulp_adjust_dynamic_symbol(struct bfd_link_info *info,
struct elf_link_hash_entry *h)
{
	bfd *dynobj;
	asection *s;
	unsigned int power_of_two;

	dynobj = elf_hash_table(info)->dynobj;

	/* Make sure we know what is going on here.  */
	BFD_ASSERT(dynobj != NULL
		&& (h->needs_plt
		|| h->u.weakdef != NULL
		|| (h->def_dynamic && h->ref_regular && !h->def_regular)));

	/* If this is a function, put it in the procedure linkage table.  We
	will fill in the contents of the procedure linkage table later,
	when we know the address of the .got section.  */
	if (h->type == STT_FUNC || h->needs_plt)
	{
		BFD_ASSERT(0);
	}

	/* If this is a weak symbol, and there is a real definition, the
	processor independent code will have arranged for us to see the
	real definition first, and we can just use the same value.  */
	if (h->u.weakdef != NULL)
	{
		BFD_ASSERT(h->u.weakdef->root.type == bfd_link_hash_defined
			|| h->u.weakdef->root.type == bfd_link_hash_defweak);
		h->root.u.def.section = h->u.weakdef->root.u.def.section;
		h->root.u.def.value = h->u.weakdef->root.u.def.value;
		return TRUE;
	}

	/* This is a reference to a symbol defined by a dynamic object which
	is not a function.  */

	/* If we are creating a shared library, we must presume that the
	only references to the symbol are via the global offset table.
	For such cases we need not do anything here; the relocations will
	be handled correctly by relocate_section.  */
	if (bfd_link_pic(info))
		return TRUE;

	/* We must allocate the symbol in our .dynbss section, which will
	become part of the .bss section of the executable.  There will be
	an entry for this symbol in the .dynsym section.  The dynamic
	object will contain position independent code, so all references
	from the dynamic object to this symbol will go through the global
	offset table.  The dynamic linker will use the .dynsym entry to
	determine the address it must put in the global offset table, so
	both the dynamic object and the regular object will refer to the
	same memory location for the variable.  */

	s = bfd_get_linker_section(dynobj, ".dynbss");
	BFD_ASSERT(s != NULL);

#if 0 /* Bfin does not currently have a COPY reloc.  */
	/* We must generate a R_ESP32ULP_COPY reloc to tell the dynamic linker to
	copy the initial value out of the dynamic object and into the
	runtime process image.  We need to remember the offset into the
	.rela.bss section we are going to use.  */
	if ((h->root.u.def.section->flags & SEC_ALLOC) != 0)
	{
		asection *srel;

		srel = bfd_get_linker_section(dynobj, ".rela.bss");
		BFD_ASSERT(srel != NULL);
		srel->size += sizeof(Elf32_External_Rela);
		h->needs_copy = 1;
	}
#else
	if ((h->root.u.def.section->flags & SEC_ALLOC) != 0)
	{
		_bfd_error_handler(_("the esp32ulp target does not currently support the generation of copy relocations"));
		return FALSE;
	}
#endif
	/* We need to figure out the alignment required for this symbol.  I
	have no idea how ELF linkers handle this.  */
	power_of_two = bfd_log2(h->size);
	if (power_of_two > 3)
		power_of_two = 3;

	/* Apply the required alignment.  */
	s->size = BFD_ALIGN(s->size, (bfd_size_type)(1 << power_of_two));
	if (power_of_two > bfd_get_section_alignment(dynobj, s))
	{
		if (!bfd_set_section_alignment(dynobj, s, power_of_two))
			return FALSE;
	}

	/* Define the symbol as being at this point in the section.  */
	h->root.u.def.section = s;
	h->root.u.def.value = s->size;

	/* Increment the section size to make room for the symbol.  */
	s->size += h->size;

	return TRUE;
}

/* The esp32ulp linker needs to keep track of the number of relocs that it
decides to copy in check_relocs for each symbol.  This is so that it
can discard PC relative relocs if it doesn't need them when linking
with -Bsymbolic.  We store the information in a field extending the
regular ELF linker hash table.  */

/* This structure keeps track of the number of PC relative relocs we have
copied for a given symbol.  */

struct esp32ulp_pcrel_relocs_copied
{
	/* Next section.  */
	struct esp32ulp_pcrel_relocs_copied *next;
	/* A section in dynobj.  */
	asection *section;
	/* Number of relocs copied in this section.  */
	bfd_size_type count;
};

/* This function is called via elf_link_hash_traverse if we are
creating a shared object.  In the -Bsymbolic case it discards the
space allocated to copy PC relative relocs against symbols which
are defined in regular objects.  For the normal shared case, it
discards space for pc-relative relocs that have become local due to
symbol visibility changes.  We allocated space for them in the
check_relocs routine, but we won't fill them in in the
relocate_section routine.

We also check whether any of the remaining relocations apply
against a readonly section, and set the DF_TEXTREL flag in this
case.  */

static bfd_boolean
esp32ulp_discard_copies(struct elf_link_hash_entry *h, void * inf)
{
	struct bfd_link_info *info = (struct bfd_link_info *) inf;
	struct esp32ulp_pcrel_relocs_copied *s;

	if (!h->def_regular || (!info->symbolic && !h->forced_local))
	{
		if ((info->flags & DF_TEXTREL) == 0)
		{
			/* Look for relocations against read-only sections.  */
			for (s = esp32ulp_hash_entry(h)->pcrel_relocs_copied;
				s != NULL; s = s->next)
				if ((s->section->flags & SEC_READONLY) != 0)
				{
					info->flags |= DF_TEXTREL;
					break;
				}
		}

