espressif/binutils-esp32ulp/bfd/elf32-esp32ulp.c
		return TRUE;
	}

	for (s = esp32ulp_hash_entry(h)->pcrel_relocs_copied;
		s != NULL; s = s->next)
		s->section->size -= s->count * sizeof(Elf32_External_Rela);

	return TRUE;
}

static bfd_boolean
esp32ulp_size_dynamic_sections(bfd * output_bfd ATTRIBUTE_UNUSED,
struct bfd_link_info *info)
{
	bfd *dynobj;
	asection *s;
	bfd_boolean relocs;

	dynobj = elf_hash_table(info)->dynobj;
	BFD_ASSERT(dynobj != NULL);

	if (elf_hash_table(info)->dynamic_sections_created)
	{
		/* Set the contents of the .interp section to the interpreter.  */
		if (bfd_link_executable(info))
		{
			s = bfd_get_linker_section(dynobj, ".interp");
			BFD_ASSERT(s != NULL);
			s->size = sizeof ELF_DYNAMIC_INTERPRETER;
			s->contents = (unsigned char *)ELF_DYNAMIC_INTERPRETER;
		}
	}
	else
	{
		/* We may have created entries in the .rela.got section.
		However, if we are not creating the dynamic sections, we will
		not actually use these entries.  Reset the size of .rela.got,
		which will cause it to get stripped from the output file
		below.  */
		s = elf_hash_table(info)->srelgot;
		if (s != NULL)
			s->size = 0;
	}

	/* If this is a -Bsymbolic shared link, then we need to discard all
	PC relative relocs against symbols defined in a regular object.
	For the normal shared case we discard the PC relative relocs
	against symbols that have become local due to visibility changes.
	We allocated space for them in the check_relocs routine, but we
	will not fill them in in the relocate_section routine.  */
	if (bfd_link_pic(info))
		elf_link_hash_traverse(elf_hash_table(info),
		esp32ulp_discard_copies, info);

	/* The check_relocs and adjust_dynamic_symbol entry points have
	determined the sizes of the various dynamic sections.  Allocate
	memory for them.  */
	relocs = FALSE;
	for (s = dynobj->sections; s != NULL; s = s->next)
	{
		const char *name;
		bfd_boolean strip;

		if ((s->flags & SEC_LINKER_CREATED) == 0)
			continue;

		/* It's OK to base decisions on the section name, because none
		of the dynobj section names depend upon the input files.  */
		name = bfd_get_section_name(dynobj, s);

		strip = FALSE;

		if (CONST_STRNEQ(name, ".rela"))
		{
			if (s->size == 0)
			{
				/* If we don't need this section, strip it from the
				output file.  This is mostly to handle .rela.bss and
				.rela.plt.  We must create both sections in
				create_dynamic_sections, because they must be created
				before the linker maps input sections to output
				sections.  The linker does that before
				adjust_dynamic_symbol is called, and it is that
				function which decides whether anything needs to go
				into these sections.  */
				strip = TRUE;
			}
			else
			{
				relocs = TRUE;

				/* We use the reloc_count field as a counter if we need
				to copy relocs into the output file.  */
				s->reloc_count = 0;
			}
		}
		else if (!CONST_STRNEQ(name, ".got"))
		{
			/* It's not one of our sections, so don't allocate space.  */
			continue;
		}

		if (strip)
		{
			s->flags |= SEC_EXCLUDE;
			continue;
		}

		/* Allocate memory for the section contents.  */
		/* FIXME: This should be a call to bfd_alloc not bfd_zalloc.
		Unused entries should be reclaimed before the section's contents
		are written out, but at the moment this does not happen.  Thus in
		order to prevent writing out garbage, we initialise the section's
		contents to zero.  */
		s->contents = (bfd_byte *)bfd_zalloc(dynobj, s->size);
		if (s->contents == NULL && s->size != 0)
			return FALSE;
	}

	if (elf_hash_table(info)->dynamic_sections_created)
	{
		/* Add some entries to the .dynamic section.  We fill in the
		values later, in esp32ulp_finish_dynamic_sections, but we
		must add the entries now so that we get the correct size for
		the .dynamic section.  The DT_DEBUG entry is filled in by the
		dynamic linker and used by the debugger.  */
#define add_dynamic_entry(TAG, VAL) \
  _bfd_elf_add_dynamic_entry (info, TAG, VAL)

		if (!bfd_link_pic(info))
		{
			if (!add_dynamic_entry(DT_DEBUG, 0))
				return FALSE;
		}


		if (relocs)
		{
			if (!add_dynamic_entry(DT_RELA, 0)
				|| !add_dynamic_entry(DT_RELASZ, 0)
				|| !add_dynamic_entry(DT_RELAENT,
				sizeof(Elf32_External_Rela)))
				return FALSE;
		}

		if ((info->flags & DF_TEXTREL) != 0)
		{
			if (!add_dynamic_entry(DT_TEXTREL, 0))
				return FALSE;
		}
	}
#undef add_dynamic_entry

	return TRUE;
}

/* Given a .data section and a .emreloc in-memory section, store
relocation information into the .emreloc section which can be
used at runtime to relocate the section.  This is called by the
linker when the --embedded-relocs switch is used.  This is called
after the add_symbols entry point has been called for all the
objects, and before the final_link entry point is called.  */

bfd_boolean
bfd_esp32ulp_elf32_create_embedded_relocs(bfd *abfd,
struct bfd_link_info *info,
	asection *datasec,
	asection *relsec,
	char **errmsg)
{
	Elf_Internal_Shdr *symtab_hdr;
	Elf_Internal_Sym *isymbuf = NULL;
	Elf_Internal_Rela *internal_relocs = NULL;
	Elf_Internal_Rela *irel, *irelend;
	bfd_byte *p;
	bfd_size_type amt;

	BFD_ASSERT(!bfd_link_relocatable(info));

	*errmsg = NULL;

	if (datasec->reloc_count == 0)
		return TRUE;

	symtab_hdr = &elf_tdata(abfd)->symtab_hdr;

	/* Get a copy of the native relocations.  */
	internal_relocs = (_bfd_elf_link_read_relocs
		(abfd, datasec, NULL, (Elf_Internal_Rela *)NULL,
		info->keep_memory));
	if (internal_relocs == NULL)
		goto error_return;

	amt = (bfd_size_type)datasec->reloc_count * 12;
	relsec->contents = (bfd_byte *)bfd_alloc(abfd, amt);
	if (relsec->contents == NULL)
		goto error_return;

	p = relsec->contents;

	irelend = internal_relocs + datasec->reloc_count;
	for (irel = internal_relocs; irel < irelend; irel++, p += 12)
	{
		/* We are going to write a four byte longword into the runtime
		reloc section.  The longword will be the address in the data
		section which must be relocated.  It is followed by the name
		of the target section NUL-padded or truncated to 8
		characters.  */

		/* We can only relocate absolute longword relocs at run time.  */
		*errmsg = _("unsupported reloc type");
		bfd_set_error(bfd_error_bad_value);
		goto error_return;
	}

